In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame(np.random.rand(12).reshape(3,4)*100,
                index=['one','two','three'],
                columns=['a','b','c','d'])

In [3]:
print(df)

               a          b          c          d
one    60.903477  73.810596  64.558018  97.742785
two    69.553157  47.237900  22.942248  15.422499
three   0.537762  19.271780  38.603765  89.477684

In [4]:
data=df[['a','d']]

In [5]:
data

               a          d
one    60.903477  97.742785
two    69.553157  15.422499
three   0.537762  89.477684

In [6]:
data1=df.loc['one']

In [8]:
data2=df.loc[['one','two']]

In [9]:
data1

a    60.903477
b    73.810596
c    64.558018
d    97.742785
Name: one, dtype: float64

In [10]:
data2

             a          b          c          d
one  60.903477  73.810596  64.558018  97.742785
two  69.553157  47.237900  22.942248  15.422499

In [12]:
data3=data.loc['two':'three']

In [13]:
data3

               a          d
two    69.553157  15.422499
three   0.537762  89.477684

In [19]:
data4=df.iloc[0:2]

In [20]:
data4

             a          b          c          d
one  60.903477  73.810596  64.558018  97.742785
two  69.553157  47.237900  22.942248  15.422499

In [21]:
b1=df<30

In [22]:
b1

           a      b      c      d
one    False  False  False  False
two    False  False   True   True
three   True   True  False  False

## bool index

In [23]:
data5=df[df>30]

In [24]:
data5

               a          b          c          d
one    60.903477  73.810596  64.558018  97.742785
two    69.553157  47.237900        NaN        NaN
three        NaN        NaN  38.603765  89.477684

In [25]:
df[df['a']>50][['b','c']]

             b          c
one  73.810596  64.558018
two  47.237900  22.942248

In [26]:
b3=df[['a','b']]>50

In [27]:
b3

           a      b
one     True   True
two     True  False
three  False  False

In [28]:
df[b3]

               a          b   c   d
one    60.903477  73.810596 NaN NaN
two    69.553157        NaN NaN NaN
three        NaN        NaN NaN NaN

In [29]:
df[b3][['a','b']]

               a          b
one    60.903477  73.810596
two    69.553157        NaN
three        NaN        NaN

In [31]:
df['a'].loc[['one','three']]

one      60.903477
three     0.537762
Name: a, dtype: float64

In [34]:
df[['b','c','a']].iloc[::2]

               b          c          a
one    73.810596  64.558018  60.903477
three  19.271780  38.603765   0.537762

In [36]:
df[df['a']<50].iloc[:2]

              a         b          c          d
three  0.537762  19.27178  38.603765  89.477684